Revit 2027 API
MEPSection.TotalPressureLoss Property
 The total pressure loss of the section.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double TotalPressureLoss { get; }
Public ReadOnly Property TotalPressureLoss As Double
	Get
public:
property double TotalPressureLoss {
	double get ();
}
member TotalPressureLoss : float with get
Property Value
Double
Remarks
 It's total of all fittings and segments. Default unit is Kgf per square feet. For Duct, unit type is UT_HVAC_Pressure. For Pipe, unit type is UT_Piping_Pressure.
See Also
Reference
MEPSection Class
Autodesk.Revit.DB.Mechanical Namespace